app/controllers/posts_controller.rb

  def create
  	#@post = current_user.posts.build(params[:post])
  	Post.create(post_params)
---
INSERT INTO "posts" ("title", "link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "abcdefghijklmnop"], ["link", "www.google.com"], ["user_id", 1], ["created_at", "2017-11-05 06:21:05.130775"], ["updated_at", "2017-11-05 06:21:05.130775"]]